# Brewfile - Homebrew packages
# Install: brew bundle --file=Brewfile

# Shell & prompt
brew "starship"
brew "antidote"
brew "tmux"

# Modern CLI replacements
brew "eza"       # ls
brew "bat"       # cat
brew "fd"        # find
brew "fzf"       # fuzzy finder
brew "zoxide"    # smart cd
brew "sd"        # sed
brew "procs"     # ps

# System monitoring
brew "htop"
brew "btop"      # htop++
brew "asitop"    # Apple Silicon monitor
brew "ncdu"      # disk usage interactif
brew "duf"       # df moderne

# Git
brew "git-delta"  # better diff pager
brew "gh"         # GitHub CLI
brew "lazygit"

# Network
brew "mtr"       # traceroute + ping
brew "nmap"
brew "wget"

# Editors
brew "micro"     # simple terminal editor
brew "neovim"    # vim on steroids

# Utils
brew "jq"        # JSON
brew "yq"        # YAML
brew "tree"
brew "ripgrep"   # needed for nvim telescope
brew "tldr"      # man simplifié
brew "glow"      # markdown dans le terminal

# Optional GUI apps (uncomment to install)
cask "iterm2"
cask "rectangle"
cask "alfred"
