# Brewfile - Homebrew packages
# Install: brew bundle --file=Brewfile

# Shell & prompt
brew "starship"
brew "antidote"

# Modern CLI replacements
brew "eza"       # ls
brew "bat"       # cat
brew "fd"        # find
brew "fzf"       # fuzzy finder

# System monitoring
brew "btop"      # htop++
brew "asitop"    # Apple Silicon monitor

# Git
brew "lazygit"

# Network
brew "mtr"       # traceroute + ping
brew "nmap"
brew "wget"

# Utils
brew "jq"        # JSON
brew "tree"

# Optional GUI apps (uncomment to install)
cask "iterm2"
cask "rectangle"
cask "alfred"
